app/views/foods/new.html.erb

                            <div class="block need_food">
                                <% WantFood.from_wantfood_list(f["id"]).order('due ASC').each do |w| %>
---
SELECT "foods".* FROM "foods" WHERE (user_id = '10202600536729493') ORDER BY due ASC