app/controllers/all_food_can_use_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."uid" = '10202600536729493'
---
  def show

  	graph = Koala::Facebook::API.new(current_user.oauth_token)
	u = graph.get_object("me")
	@friends = graph.get_connections(u["id"],"friends")
	@friend_and_me_food = Food.where(uid: current_user.uid)