app/controllers/all_food_can_use_controller.rb

  def show

  	graph = Koala::Facebook::API.new(current_user.oauth_token)
	u = graph.get_object("me")
	@friends = graph.get_connections(u["id"],"friends")
	@friend_and_me_food = Food.where(user_id: current_user.uid)
---
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = 1