app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE (uid = '10202600536729493') ORDER BY due ASC
---
  def new
    @foods = Food.from_food_list(current_user).order('due ASC')

INSERT INTO "foods" ("category", "created_at", "due", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category", "fruit"], ["created_at", Fri, 09 Jan 2015 20:00:22 UTC +00:00], ["due", Fri, 16 Jan 2015], ["name", "apple"], ["updated_at", Fri, 09 Jan 2015 20:00:22 UTC +00:00], ["user_id", 1]]
---
  def create
    @food = Food.new(create_params)
    @food.user_id = current_user.uid
    @food.uid = current_user.uid

    if @food.save